RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Inc/stm32u5xx_hal_pwr_ex.h
/* Private macros --------------------------------------------------------*/

/** @addtogroup PWREx_Private_Macros PWR Extended Private Macros
  * @{
  */
/* PVM type check macro */
#define IS_PWR_PVM_TYPE(TYPE)   \
  (((TYPE) == PWR_UVM )       ||\
   ((TYPE) == PWR_IO2VM)      ||\
   ((TYPE) == PWR_AVM1)       ||\
   ((TYPE) == PWR_AVM2))

/* PVM mode check macro */
#define IS_PWR_PVM_MODE(MODE)                   \
  (((MODE) == PWR_PVM_MODE_NORMAL)            ||\
   ((MODE) == PWR_PVM_MODE_IT_RISING)         ||\
   ((MODE) == PWR_PVM_MODE_IT_FALLING)        ||\
   ((MODE) == PWR_PVM_MODE_IT_RISING_FALLING) ||\
   ((MODE) == PWR_PVM_MODE_EVENT_RISING)      ||\
   ((MODE) == PWR_PVM_MODE_EVENT_FALLING)     ||\
   ((MODE) == PWR_PVM_MODE_EVENT_RISING_FALLING))

/* SRD state check macro */
#define IS_PWR_SRD_STATE(SRD_STATE)       \
  (((SRD_STATE) == PWR_SRD_DOMAIN_STOP) ||\
   ((SRD_STATE) == PWR_SRD_DOMAIN_RUN))

/* Supply selection check macro */
#define IS_PWR_SUPPLY(PWR_SOURCE)     \
  (((PWR_SOURCE) == PWR_LDO_SUPPLY) ||\
   ((PWR_SOURCE) == PWR_SMPS_SUPPLY))

/* Voltage scaling range check macro */
#define IS_PWR_VOLTAGE_SCALING_RANGE(RANGE)    \
  (((RANGE) == PWR_REGULATOR_VOLTAGE_SCALE1) ||\
   ((RANGE) == PWR_REGULATOR_VOLTAGE_SCALE2) ||\
   ((RANGE) == PWR_REGULATOR_VOLTAGE_SCALE3) ||\
   ((RANGE) == PWR_REGULATOR_VOLTAGE_SCALE4))

/* Battery charging resistor selection check macro */
#define IS_PWR_BATTERY_RESISTOR_SELECT(RESISTOR)     \
  (((RESISTOR) == PWR_BATTERY_CHARGING_RESISTOR_5) ||\
   ((RESISTOR) == PWR_BATTERY_CHARGING_RESISTOR_1_5))

/* Battery charging activation check macro */
#define IS_PWR_BATTERY_CHARGING(CHARGING)         \
  (((CHARGING) == PWR_BATTERY_CHARGING_DISABLE) ||\
   ((CHARGING) == PWR_BATTERY_CHARGING_ENABLE))

/* GPIO port check macro */
#define IS_PWR_GPIO_PORT(GPIO_PORT)   \
  (((GPIO_PORT) == PWR_GPIO_A)      ||\
   ((GPIO_PORT) == PWR_GPIO_B)      ||\
   ((GPIO_PORT) == PWR_GPIO_C)      ||\
   ((GPIO_PORT) == PWR_GPIO_D)      ||\
   ((GPIO_PORT) == PWR_GPIO_E)      ||\
   ((GPIO_PORT) == PWR_GPIO_F)      ||\
   ((GPIO_PORT) == PWR_GPIO_G)      ||\
   ((GPIO_PORT) == PWR_GPIO_H)      ||\
   ((GPIO_PORT) == PWR_GPIO_I))

/* GPIO pin mask check macro */
#define IS_PWR_GPIO_PIN_MASK(BIT_MASK) \
  ((((BIT_MASK) & GPIO_PIN_MASK) != 0U) && ((BIT_MASK) <= GPIO_PIN_MASK))

/* SRAM2 retention in Standby mode check macro */
#define IS_PWR_SRAM2_STANDBY_RETENTION(CONTENT)       \
  (((CONTENT) == PWR_SRAM2_PAGE1_STANDBY_RETENTION) ||\
   ((CONTENT) == PWR_SRAM2_PAGE2_STANDBY_RETENTION) ||\
   ((CONTENT) == PWR_SRAM2_FULL_STANDBY_RETENTION))

/* RAMs retention in Stop mode check macros */
#define IS_PWR_SRAM1_STOP_RETENTION(RAMCONTENT) \
  ((((RAMCONTENT) & (~PWR_SRAM1_FULL_STOP_RETENTION)) == 0U) && ((RAMCONTENT) != 0U))

#define IS_PWR_SRAM2_STOP_RETENTION(RAMCONTENT) \
  ((((RAMCONTENT) & (~PWR_SRAM2_FULL_STOP_RETENTION)) == 0U) && ((RAMCONTENT) != 0U))

#define IS_PWR_SRAM3_STOP_RETENTION(RAMCONTENT) \
  ((((RAMCONTENT) & (~PWR_SRAM3_FULL_STOP_RETENTION)) == 0U) && ((RAMCONTENT) != 0U))

#define IS_PWR_SRAM4_STOP_RETENTION(RAMCONTENT) \
  ((((RAMCONTENT) & (~PWR_SRAM4_FULL_STOP_RETENTION)) == 0U) && ((RAMCONTENT) != 0U))

#define IS_PWR_ICACHE_STOP_RETENTION(RAMCONTENT) \
  ((((RAMCONTENT) & (~PWR_ICACHE_FULL_STOP_RETENTION)) == 0U) && ((RAMCONTENT) != 0U))

#define IS_PWR_DCACHE1_STOP_RETENTION(RAMCONTENT) \
  ((((RAMCONTENT) & (~PWR_DCACHE1_FULL_STOP_RETENTION)) == 0U) && ((RAMCONTENT) != 0U))

#define IS_PWR_DMA2DRAM_STOP_RETENTION(RAMCONTENT) \
  ((((RAMCONTENT) & (~PWR_DMA2DRAM_FULL_STOP_RETENTION)) == 0U) && ((RAMCONTENT) != 0U))

#define IS_PWR_PERIPHRAM_STOP_RETENTION(RAMCONTENT) \
  ((((RAMCONTENT) & (~PWR_PERIPHRAM_FULL_STOP_RETENTION)) == 0U) && ((RAMCONTENT) != 0U))

#define IS_PWR_PKA32RAM_STOP_RETENTION(RAMCONTENT) \
  ((((RAMCONTENT) & (~PWR_PKA32RAM_FULL_STOP_RETENTION)) == 0U) && ((RAMCONTENT) != 0U))

/* RAMs retention in Run mode check macro */
#define IS_PWR_RAM_RUN_RETENTION(RAMCONTENT) \
  ((((RAMCONTENT) & (~PWR_ALL_RAM_RUN_RETENTION_MASK)) == 0U) && ((RAMCONTENT) != 0U))
/**
  * @}
  */

/** @addtogroup PWREx_Exported_Functions PWR Extended Exported Functions
  * @{
  */

/** @addtogroup PWREx_Exported_Functions_Group1 Power Supply Control Functions
  * @{
  */
HAL_StatusTypeDef HAL_PWREx_ControlVoltageScaling(uint32_t VoltageScaling);
uint32_t          HAL_PWREx_GetVoltageRange(void);
HAL_StatusTypeDef HAL_PWREx_ConfigSupply(uint32_t SupplySource);
uint32_t          HAL_PWREx_GetSupplyConfig(void);
void              HAL_PWREx_EnableFastSoftStart(void);
void              HAL_PWREx_DisableFastSoftStart(void);
/**
  * @}
  */

/** @addtogroup PWREx_Exported_Functions_Group2 Low Power Control Functions
  * @{
  */
void HAL_PWREx_EnterSTOP1Mode(uint8_t STOPEntry);
void HAL_PWREx_EnterSTOP2Mode(uint8_t STOPEntry);
void HAL_PWREx_EnterSTOP3Mode(uint8_t STOPEntry);
void HAL_PWREx_EnterSHUTDOWNMode(void);
void HAL_PWREx_ConfigSRDDomain(uint32_t SRDState);
void HAL_PWREx_EnableUltraLowPowerMode(void);
void HAL_PWREx_DisableUltraLowPowerMode(void);
void HAL_PWREx_S3WU_IRQHandler(uint32_t WakeUpPin);
void HAL_PWREx_S3WUCallback(uint32_t WakeUpPin);
/**
  * @}
  */

/** @addtogroup PWREx_Exported_Functions_Group3 Voltage Monitoring Functions
  * @{
  */
void              HAL_PWREx_EnableBatteryCharging(uint32_t ResistorValue);
void              HAL_PWREx_DisableBatteryCharging(void);
void              HAL_PWREx_EnableVddUSB(void);
void              HAL_PWREx_DisableVddUSB(void);
void              HAL_PWREx_EnableVddIO2(void);
void              HAL_PWREx_DisableVddIO2(void);
void              HAL_PWREx_EnableVddA(void);
void              HAL_PWREx_DisableVddA(void);
void              HAL_PWREx_EnableUVM(void);
void              HAL_PWREx_DisableUVM(void);
void              HAL_PWREx_EnableIO2VM(void);
void              HAL_PWREx_DisableIO2VM(void);
void              HAL_PWREx_EnableAVM1(void);
void              HAL_PWREx_DisableAVM1(void);
void              HAL_PWREx_EnableAVM2(void);
void              HAL_PWREx_DisableAVM2(void);
HAL_StatusTypeDef HAL_PWREx_ConfigPVM(PWR_PVMTypeDef *pConfigPVM);
void              HAL_PWREx_EnableMonitoring(void);
void              HAL_PWREx_DisableMonitoring(void);
void              HAL_PWREx_EnableUCPDStandbyMode(void);
void              HAL_PWREx_DisableUCPDStandbyMode(void);
void              HAL_PWREx_EnableUCPDDeadBattery(void);
void              HAL_PWREx_DisableUCPDDeadBattery(void);
void              HAL_PWREx_PVD_PVM_IRQHandler(void);
void              HAL_PWREx_UVMCallback(void);
void              HAL_PWREx_IO2VMCallback(void);
void              HAL_PWREx_AVM1Callback(void);
void              HAL_PWREx_AVM2Callback(void);
/**
  * @}
  */

/** @addtogroup PWREx_Exported_Functions_Group4 Memories Retention Functions
  * @{
  */
void              HAL_PWREx_EnableSRAM2ContentStandbyRetention(uint32_t SRAM2Pages);
void              HAL_PWREx_DisableSRAM2ContentStandbyRetention(uint32_t SRAM2Pages);
void              HAL_PWREx_EnableRAMsContentStopRetention(uint32_t RAMSelection);
void              HAL_PWREx_DisableRAMsContentStopRetention(uint32_t RAMSelection);
void              HAL_PWREx_EnableRAMsContentRunRetention(uint32_t RAMSelection);
void              HAL_PWREx_DisableRAMsContentRunRetention(uint32_t RAMSelection);
void              HAL_PWREx_EnableFlashFastWakeUp(void);
void              HAL_PWREx_DisableFlashFastWakeUp(void);
void              HAL_PWREx_EnableSRAM4FastWakeUp(void);
void              HAL_PWREx_DisableSRAM4FastWakeUp(void);
HAL_StatusTypeDef HAL_PWREx_EnableBkupRAMRetention(void);
void              HAL_PWREx_DisableBkupRAMRetention(void);
/**
  * @}
  */

/** @addtogroup PWREx_Exported_Functions_Group5 I/O Pull-Up Pull-Down Configuration Functions
  * @{
  */
void              HAL_PWREx_EnablePullUpPullDownConfig(void);
void              HAL_PWREx_DisablePullUpPullDownConfig(void);
HAL_StatusTypeDef HAL_PWREx_EnableGPIOPullUp(uint32_t GPIO_Port, uint32_t GPIO_Pin);
HAL_StatusTypeDef HAL_PWREx_DisableGPIOPullUp(uint32_t GPIO_Port, uint32_t GPIO_Pin);
HAL_StatusTypeDef HAL_PWREx_EnableGPIOPullDown(uint32_t GPIO_Port, uint32_t GPIO_Pin);
HAL_StatusTypeDef HAL_PWREx_DisableGPIOPullDown(uint32_t GPIO_Port, uint32_t GPIO_Pin);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */


#endif /* STM32U5xx_HAL_PWR_EX_H */
